In [1]:
import pandas as pd

In [2]:
df = pd.read_csv(r'C:\Users\Public\Documents\weather.csv')

In [26]:
df.head()

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
4  1/1/2017    mumbai           90          5  Sunny

In [24]:
#We can also convert a dictionary to data frame

Weather_data ={
    'day': ['1/1/2017'],
    'city': ['NewYork'],
    'temparature': [32],
    'windspeed' : [6],
    'event':  ['rain']
}

#print(Weather_data)
df1 = pd.DataFrame(Weather_data)
df1.head()

        day     city  temparature  windspeed event
0  1/1/2017  NewYork           32          6  rain

In [30]:
# shape means, The dimension of the data frame

#df.head()

df.shape

(12, 5)

In [31]:
# you can assign shape and print 
rows,columns = df.shape

In [32]:
rows

12

In [33]:
columns

5

In [34]:
# df.tail() will print last 5 rows

df.tail()

         day    city  temperature  windspeed   event
7   1/4/2017  mumbai           92          5    Rain
8   1/1/2017   paris           45         20   Sunny
9   1/2/2017   paris           50         13  Cloudy
10  1/3/2017   paris           54          8  Cloudy
11  1/4/2017   paris           42         10  Cloudy

In [35]:
# you can send parameter in tail function
df.tail(8)

         day    city  temperature  windspeed   event
4   1/1/2017  mumbai           90          5   Sunny
5   1/2/2017  mumbai           85         12     Fog
6   1/3/2017  mumbai           87         15     Fog
7   1/4/2017  mumbai           92          5    Rain
8   1/1/2017   paris           45         20   Sunny
9   1/2/2017   paris           50         13  Cloudy
10  1/3/2017   paris           54          8  Cloudy
11  1/4/2017   paris           42         10  Cloudy

In [36]:
#If you want print rows from 2 to 5

df[2:6]

        day      city  temperature  windspeed  event
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
4  1/1/2017    mumbai           90          5  Sunny
5  1/2/2017    mumbai           85         12    Fog

In [38]:
# IT will print everything
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [39]:
# syntax to print all columns
df.columns

Index(['day', 'city', 'temperature', 'windspeed', 'event'], dtype='object')

In [41]:
# to print individual column
df.day

0     1/1/2017
1     1/2/2017
2     1/3/2017
3     1/4/2017
4     1/1/2017
5     1/2/2017
6     1/3/2017
7     1/4/2017
8     1/1/2017
9     1/2/2017
10    1/3/2017
11    1/4/2017
Name: day, dtype: object

In [44]:
# to print multiple columns
df.day

0     1/1/2017
1     1/2/2017
2     1/3/2017
3     1/4/2017
4     1/1/2017
5     1/2/2017
6     1/3/2017
7     1/4/2017
8     1/1/2017
9     1/2/2017
10    1/3/2017
11    1/4/2017
Name: day, dtype: object

In [46]:
# you can also use this synax to print individual columns

df['day']

0     1/1/2017
1     1/2/2017
2     1/3/2017
3     1/4/2017
4     1/1/2017
5     1/2/2017
6     1/3/2017
7     1/4/2017
8     1/1/2017
9     1/2/2017
10    1/3/2017
11    1/4/2017
Name: day, dtype: object

In [52]:
# Access multiple columns 
df[['day', 'city', 'event']]

         day      city   event
0   1/1/2017  new york    Rain
1   1/2/2017  new york   Sunny
2   1/3/2017  new york    Snow
3   1/4/2017  new york   Sunny
4   1/1/2017    mumbai   Sunny
5   1/2/2017    mumbai     Fog
6   1/3/2017    mumbai     Fog
7   1/4/2017    mumbai    Rain
8   1/1/2017     paris   Sunny
9   1/2/2017     paris  Cloudy
10  1/3/2017     paris  Cloudy
11  1/4/2017     paris  Cloudy

In [54]:
df['temperature']

0     32
1     36
2     28
3     33
4     90
5     85
6     87
7     92
8     45
9     50
10    54
11    42
Name: temperature, dtype: int64

In [55]:
#Ma of temperature
df['temperature'].max()

92

In [56]:
# You can do other operations as well eg. min, std.
df['temperature'].mean()

56.166666666666664

In [58]:
df.describe()
#It will print statistics

       temperature  windspeed
count    12.000000  12.000000
mean     56.166667  10.000000
std      25.044808   4.572646
min      28.000000   5.000000
25%      35.250000   6.750000
50%      47.500000   9.000000
75%      85.500000  12.250000
max      92.000000  20.000000